models/Internaute.php

    public static function getUserByEmail($email){
        return Internaute::findOne([
            'mail' => $email
        ]);
---
SELECT * FROM "fredouil"."internaute" WHERE "mail"='fourmi@gmail.com'

    public static function findIdentity($id){
        return Internaute::findOne($id);
---
SELECT * FROM "fredouil"."internaute" WHERE "id"=1