models/Reservation.php

    public static function getReservationsByVoyageId($id){
        return Reservation::findAll([
            'voyage' => $id
        ]);
---
SELECT * FROM "fredouil"."reservation" WHERE "voyage"=13