models/Trajet.php

SELECT * FROM "fredouil"."trajet" WHERE ("depart"='Paris') AND ("arrivee"='Marseille')
---
    public static function getTrajet($depart,$arrivee){
        return Trajet::findOne([
            'depart' => $depart,
            'arrivee' => $arrivee
        ]);