models/Voyage.php

    public static function getVoyagesByTrajetId($id){
        return Voyage::findAll([
            'trajet' => $id
        ]);
---
SELECT * FROM "fredouil"."voyage" WHERE "trajet"=383